* The fundamental theorems of Calculus

** Solution 1

$\int_1^3 (2x + 1) \mathrm{d}x$

We need an antiderivative of $2x + 1$.

One antiderivative for this is $x^2 + x$. This is an antiderivative on
the interval $(-\infty, \infty)$.

From theorem 5.4.3,

$\int_1^3 (2x + 1) \mathrm{d}x = x^2 + x |_1^3 = 3^2 + 3 - (1 + 1)$

$= 10$

** Solution 2

$\int_1^4 x^3 \mathrm{d}x$

We need an antiderivative of $x^3$.

One antiderivative for this is $\dfrac{x^4}{4}$. This is an antiderivative on
the interval $(-\infty, \infty)$.

From theorem 5.4.3,

$\int_1^4 x^3 \mathrm{d}x = \dfrac{x^4}{4} |_1^4 = 4^3 - 1 = 63$

** Solution 3

$\int_{-1}^2 2x^3 - 3x^2 + 4x - 5 \mathrm{d}x$

We need an antiderivative of $2x^3 - 3x^2 + 4x - 5$.

One antiderivative for this is $\dfrac{x^4}{2} - x^3 + 2x^2 -
5x$. This is an antiderivative on the interval $(-\infty, \infty)$

From theorem 5.4.3,

$\int_{-1}^2 2x^3 - 3x^2 + 4x - 5 \mathrm{d}x = \dfrac{x^4}{2} - x^3 +
2x^2 - 5x |_{-1}^2$

Let's compute the remaining solution using sagemath:

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
x = var('x')
f = (x^4)/2 - x^3 + (2*x^2) - 5*x
f(2) - f(-1)
#+end_src

#+RESULTS:
: -21/2

** Solution 4

$\int_0^1 x^{100} \mathrm{d}x$

We need an antiderivative of $x^100$

One antiderivative for this is $\dfrac{x^{101}}{101}$. This is an
antiderivative on the interval $(-\infty, \infty)$.

From theorem 5.4.3,

$\int_0^1 x^{100} \mathrm{d}x = \dfrac{x^{101}}{101} |_0^1$

Let's compute the remaining solution using sagemath:

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
x = var('x')
f = x^(101)/101
f(1) - f(0)
#+end_src

#+RESULTS:
: 1/101

** Solution 5

$\int_0^4 \sqrt{x} \mathrm{d}x$

We need an antiderivative of $\sqrt{x}$.

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
f = sqrt(x)
f
from sage.symbolic.integration.integral import indefinite_integral
g = indefinite_integral(f, x)
g
#+end_src

#+RESULTS:
: sqrt(x)
: 2/3*x^(3/2)

One antiderivative for this is $\dfrac{2x^{3/2}}{3}$. This is an
antiderivative on the interval $(-\infty, \infty)$

From theorem 5.4.3,

$\int_0^4 \sqrt{x} \mathrm{d}x = \dfrac{2x^{3/2}}{3} |_0^4$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
g
g(4) - g(0)
#+end_src

#+RESULTS:
: 2/3*x^(3/2)
: 16/3

** Solution 6

$\int_{-1}^8 \sqrt[3]{x} \mathrm{d}x$

We need an antiderivative of $\sqrt[3]{x}$.

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
f = x^(1/3)
g = indefinite_integral(f, x)
g
#+end_src

#+RESULTS:
: 3/4*x^(4/3)

One antiderivative for this is $3/4*x^(4/3)$. This is an
antiderivative on the interval $(-\infty, \infty)$

From theorem 5.4.3,

$\int_{-1}^8 \sqrt[3]{x} \mathrm{d}x = 3/4*x^(4/3) |_{-1}^8$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
g
g(8) - g(-1)
#+end_src

#+RESULTS:
: 3/4*x^(4/3)
: 3/4*(-1)^(1/3) + 12

** Solution 7

$\int_0^{2\pi} (1 + \sin x) \mathrm{d}x$

We need an antiderivative of $(1 + \sin x)$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
f = (1 + sin(x))
g = indefinite_integral(f, x)
g
#+end_src

#+RESULTS:
: x - cos(x)

One antiderivative for this is $x - \cos x$. This is an
antiderivative on the interval $(-\infty, \infty)$

From theorem 5.4.3,

$\int_0^{2\pi} (1 + \sin x) \mathrm{d}x = x - cos(x) |_0^{2\pi}$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
g
g(2*pi) - g(0)
#+end_src

#+RESULTS:
: x - cos(x)
: 2*pi

** Solution 8

$\int_1^4 \dfrac{x^3 + 3}{x^2} \mathrm{d}x$

We need an antiderivative of $\dfrac{x^3 + 3}{x^2}$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
f = (x^3 + 3)/x^2
g = indefinite_integral(f, x)
g
#+end_src

#+RESULTS:
: 1/2*x^2 - 3/x

One antiderivative for this is $1/2*x^2 - 3/x$. This is an
antiderivative on the interval $(-\infty, 0) \cup (0, \infty)$

From theorem 5.4.3,

$\int_1^4 \dfrac{x^3 + 3}{x^2} \mathrm{d}x = 1/2*x^2 - 3/x |_1^4$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
g
g(4) - g(1)
#+end_src

#+RESULTS:
: 1/2*x^2 - 3/x
: 39/4

** Solution 9

$\int_1^4 (\sqrt(x) + 1)^2 \mathrm{d}x$

We need an antiderivative of $(\sqrt(x) + 1)^2$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
f = (sqrt(x) + 1)^2
g = indefinite_integral(f, x)
g
#+end_src

#+RESULTS:
: 1/2*x^2 + 4/3*x^(3/2) + x

One antiderivative for this is $1/2*x^2 + 4/3*x^(3/2) + x$. This is an
antiderivative on the interval $[0, \infty)$.

From theorem 5.4.3,

$\int_1^4 (\sqrt(x) + 1)^2 \mathrm{d}x = 1/2*x^2 + 4/3*x^(3/2) + x |_1^4$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
g
g(4) - g(1)
#+end_src

#+RESULTS:
: 1/2*x^2 + 4/3*x^(3/2) + x
: 119/6

** Solution 10

$\int_1^4 \dfrac{(\sqrt{x} + 1)^2}{\sqrt{x}} \mathrm{d}x$

We need an antiderivative of $\dfrac{(\sqrt{x} + 1)^2}{\sqrt{x}}$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
f = (sqrt(x) + 1)^2/sqrt(x)
g = indefinite_integral(f,x)
g
#+end_src

#+RESULTS:
: 2/3*(sqrt(x) + 1)^3

One antiderivative for this is $1/2*x^2 + 4/3*x^(3/2) + x$. This is an
antiderivative on the interval $(0, \infty)$

From theorem 5.4.3,

$\int_1^4 \dfrac{(\sqrt{x} + 1)^2}{\sqrt{x}} \mathrm{d}x = 2/3*(sqrt(x) + 1)^3 |_1^4$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
g
g(4) - g(1)
#+end_src

#+RESULTS:
: 2/3*(sqrt(x) + 1)^3
: 38/3

** Solution 11

$\int_0^2 x^2(x+1)^3 \mathrm{d}x$

We need an antiderivative of $x^2(x+1)^3$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
f = x^2 * (x+1)^3
g = indefinite_integral(f,x)
g
#+end_src

#+RESULTS:
: 1/6*x^6 + 3/5*x^5 + 3/4*x^4 + 1/3*x^3

One antiderivative for this is $1/6*x^6 + 3/5*x^5 + 3/4*x^4 +
1/3*x^3$. This is an antiderivative on the interval $(-\infty,
\infty)$.

From theorem 5.4.3,

$\int_0^2 x^2(x+1)^3 \mathrm{d}x = 1/6*x^6 + 3/5*x^5 + 3/4*x^4 + 1/3*x^3 |_0^2$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
g(2) - g(0)
#+end_src

#+RESULTS:
: 668/15

** Solution 12

$\int_{\pi/6}^{\pi/3} \csc x \cot x \mathrm{d}x$

We know that $\csc x = \dfrac{1}{\sin x}$ and $\cot x = \dfrac{\cos x}{\sin x}$

So the function is not defined when $x = 0$ and $x = 2\pi$.

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
f = csc(x) * cot(x)
g = indefinite_integral(f, x)
g
#+end_src

#+RESULTS:
: -1/sin(x)

One antiderivative for this is $-\dfrac{1}{\sin x}$. This is an
antiderivative on interval $(0, 2*\pi)$

From theorem 5.4.3,

$\int_{\pi/6}^{\pi/3} \csc x \cot x \mathrm{d}x = \dfrac{-1}{\sin x} |_{\pi/6}^{\pi/3}$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
g(pi/3) - g(pi/6)
#+end_src

#+RESULTS:
: -2/3*sqrt(3) + 2

** Solution 13

$\int_1^2 t^3 - 4t \mathrm{d}t$

Suppose $n$ is a positive integer. We begin by computing all of the
quantities mentioned in Definition 5.3.1. We have $f(x) = x^3 - 4x, a =
1, b = 2$, so $\Delta x = \dfrac{(b-a)}{n}$

$= \dfrac{2-1}{n} = \dfrac{1}{n}$

Next, the points that divided the interval $[1,3]$ into $n$ smaller
intervals are given by the formula

$x_i = a + i \Delta x = 1 + i \dfrac{1}{n} = 1 + \dfrac{i}{n}$

Finally, we must choose the sample points $x^{*}_i \in [x_{i-1},
x_i]$. According to theorem 5.3.2, it doesn't matter what choice we
make; all choices will lead to the same value when we take the limit
of the Riemann $n$ sum as $n \to \infty$.

Let $x_i^{*} = x_i = 1 + \dfrac{i}{n}$

We can now work out a formula for the Riemann sum:

$R_n = \sum_{i=1}^n f(x_i^{*})\Delta x = \sum_{i=1}^n f(1 + \dfrac{i}{n}) * \dfrac{1}{n}$

$= \sum_{i=1}^n ((1 + \dfrac{i}{n})^3 - 4 - \dfrac{4i}{n})*\dfrac{1}{n}$

Let's compute the result using sagemath:

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
i,n = var('i n')
f = ((1 + i/n)^3 - 4 - (4*i/n)) * (1/n)
soln = sum(f, i, 1, n)
soln.expand()
#+end_src

#+RESULTS:
: 3/2/n + 3/4/n^2 - 9/4

Now we know that $R_n = 3/2/n + 3/4/n^2 - 9/4$

$\int_1^3 t^3 - 4t \mathrm{d}t = \lim_{n \to \infty} R_n = \dfrac{-9}{4}$
